       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD-PAYCHECK.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL RETIREES
               ASSIGN TO "RETIREE.DB"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS RETIREE-ID.
           SELECT OPTIONAL PAYCHECKS
               ASSIGN TO "PAYCHECK.DB"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS PAYCHECK-ID
               ALTERNATE KEY IS RETIREE-ID OF PAYCHECK
               WITH DUPLICATES.
           SELECT INPUT-FILE
               ASSIGN TO "INPUT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OPTIONAL OUTPUT-FILE
               ASSIGN TO "OUTPUT.TXT".

       DATA DIVISION.
       FILE SECTION.
       FD RETIREES.
       01 RETIREE.
       COPY RETIREE.
       FD PAYCHECKS.
       01 PAYCHECK.
       COPY PAYCHECK.
       FD INPUT-FILE.
       01 PAYCHECK-INPUT.
           05 RETIREE-ID PIC 9(10).
           05 FILLER PIC X(1) VALUE ' '.
           05 PASSCODE PIC X(16).
           05 FILLER PIC X(1) VALUE ' '.
           05 DATE-INPUT PIC 9(8).
           05 FILLER PIC X(1) VALUE ' '.
           05 AMOUNT PIC 9(6)V9(2).
           05 FILLER PIC X(1) VALUE ' '.
           05 SIGNATURE PIC X(32).
       FD OUTPUT-FILE
       REPORT IS OUT-REPORT.

       WORKING-STORAGE SECTION.
       01 PASSCODE-VALID PIC 9(16).
       01 PASSCODE-ATTEMPT PIC 9(16).

       REPORT SECTION.
       COPY OUT-REPORT.
`      01 REPORT-HEADING TYPE IS PAGE HEADING.
           05 LINE 1.
               10 COLUMN 26 PIC X(32)
                  VALUE "RosMosGosKosmos".
           05 LINE 2.
               10 COLUMN 20 PIC X(40)
                  VALUE "NOVIY VAUCHER - TOTAL REPORT".
           05 LINE 4.
               10 COLUMN 2 PIC X(10) VALUE "Nomer".
               10 COLUMN 13 PIC X(10) VALUE "Nomer deda".
               10 COLUMN 24 PIC X(11) VALUE "Den'".
               10 COLUMN 35 PIC X(9) VALUE "Summa".

       01 REPORT-LINE TYPE IS DETAIL.
           05 LINE PLUS 1.
               10 COLUMN 2 PIC 9(10) SOURCE PAYCHECK-ID.
               10 COLUMN 13 PIC 9(10) SOURCE RETIREE-ID OF PAYCHECK.
               10 COLUMN 24 PIC 9(4) SOURCE YEAR OF PAYCHECK-DATE.
               10 COLUMN 28 PIC X(1) VALUE ".".
               10 COLUMN 29 PIC 9(2) SOURCE MONTH OF PAYCHECK-DATE.
               10 COLUMN 31 PIC X(1) VALUE ".".
               10 COLUMN 32 PIC 9(2) SOURCE DOM OF PAYCHECK-DATE.
               10 COLUMN 35 PIC 9(6)V9(2) SOURCE AMOUNT OF PAYCHECK.

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE.
           OPEN INPUT RETIREES.
           OPEN I-O PAYCHECKS.
           START PAYCHECKS FIRST
               INVALID KEY MOVE 9999999999 TO PAYCHECK-ID
               NOT INVALID KEY READ PAYCHECKS NEXT
           END-START.

           OPEN OUTPUT OUTPUT-FILE.
           INITIATE OUT-REPORT.
           PERFORM FOREVER
               READ INPUT-FILE AT END
                   EXIT PERFORM
               END-READ
               PERFORM PROCESS-LINE
           END-PERFORM.
           TERMINATE OUT-REPORT.
           CLOSE OUTPUT-FILE.

           CLOSE PAYCHECKS.
           CLOSE RETIREES.
           CLOSE INPUT-FILE.
           STOP RUN.

       PROCESS-LINE.
           MOVE RETIREE-ID OF PAYCHECK-INPUT TO RETIREE-ID OF PAYCHECK.
           MOVE DATE-INPUT(1:4) TO YEAR OF PAYCHECK-DATE.
           MOVE DATE-INPUT(5:2) TO MONTH OF PAYCHECK-DATE.
           MOVE DATE-INPUT(7:2) TO DOM OF PAYCHECK-DATE.
           MOVE AMOUNT OF PAYCHECK-INPUT TO AMOUNT OF PAYCHECK.
           MOVE SIGNATURE OF PAYCHECK-INPUT TO SIGNATURE OF PAYCHECK.

           MOVE RETIREE-ID OF PAYCHECK-INPUT TO RETIREE-ID OF RETIREE.
           READ RETIREES RECORD INVALID KEY
               DISPLAY 'RETIREE NOT FOUND'
               EXIT PARAGRAPH
           END-READ.

           IF MONTH OF PAYCHECK-DATE > 12 OR MONTH OF PAYCHECK-DATE < 1
               DISPLAY 'MONTH IS INVALID'
               EXIT PARAGRAPH
           END-IF.
           IF DOM OF PAYCHECK-DATE > 31 OR DOM OF PAYCHECK-DATE < 1
               DISPLAY 'PAYCHECK DATE IS INVALID'
               EXIT PARAGRAPH
           END-IF.
           IF AMOUNT OF PAYCHECK = ZEROES
               DISPLAY 'ZERO AMOUNT IS NOT ALLOWED'
               EXIT PARAGRAPH
           END-IF.
           IF SIGNATURE OF PAYCHECK = SPACES
               DISPLAY 'NO SIGNATURE IS NOT ALLOWED'
               EXIT PARAGRAPH
           END-IF.

           MOVE PASSCODE OF RETIREE TO PASSCODE-VALID.
           MOVE PASSCODE OF PAYCHECK-INPUT TO PASSCODE-ATTEMPT.
           IF PASSCODE-VALID NOT = PASSCODE-ATTEMPT
               DISPLAY 'INVALID PASSCODE'
               EXIT PARAGRAPH
           END-IF.

           SUBTRACT 1 FROM PAYCHECK-ID.
           DISPLAY 'SUCCESS, NEW ID ' PAYCHECK-ID.
           WRITE PAYCHECK.
           GENERATE REPORT-LINE.
