       01 REPORT-FOOTING TYPE IS PAGE FOOTING.
           05 LINE IS 33.
               10 COLUMN 1 PIC X(29) VALUE "Spasibo za obrashenie.".
               10 COLUMN 61 PIC X(6) VALUE "Page :".
               10 COLUMN 67 PIC Z99 SOURCE PAGE-COUNTER.
