       05 PAYCHECK-ID PIC 9(10).
       05 RETIREE-ID PIC 9(10).
       05 PAYCHECK-DATE.
           10 YEAR PIC 9(4).
           10 MONTH PIC 9(2).
           10 DOM PIC 9(2).
       05 AMOUNT PIC 9(6).9(2).
       05 SIGNATURE PIC X(32).
