       05 RETIREE-ID PIC 9(10).
       05 PASSCODE PIC 9(16).
       05 RETIREE-NAME.
           10 LAST-NAME PIC A(20).
           10 FIRST-NAME PIC A(20).
       05 DOB.
           10 YEAR PIC 9(4).
           10 MONTH PIC 9(2).
           10 DOM PIC 9(2).
