       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHOW-PAYCHECKS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OPTIONAL RETIREES
               ASSIGN TO "RETIREE.DB"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS RETIREE-ID.
           SELECT OPTIONAL PAYCHECKS
               ASSIGN TO "PAYCHECK.DB"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS PAYCHECK-ID
               ALTERNATE KEY IS RETIREE-ID OF PAYCHECK
               WITH DUPLICATES.
           SELECT INPUT-FILE
               ASSIGN TO "INPUT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OPTIONAL OUTPUT-FILE
               ASSIGN TO "OUTPUT.TXT".

       DATA DIVISION.
       FILE SECTION.
       FD RETIREES.
       01 RETIREE.
       COPY RETIREE.
       FD PAYCHECKS.
       01 PAYCHECK.
       COPY PAYCHECK.
       FD INPUT-FILE.
       01 REQUEST-INPUT.
           05 RETIREE-ID PIC 9(10).
           05 FILLER PIC X(1) VALUE ' '.
           05 PASSCODE PIC X(16).
       FD OUTPUT-FILE
       REPORT IS OUT-REPORT.

       WORKING-STORAGE SECTION.
       01 PASSCODE-VALID PIC 9(16).
       01 PASSCODE-ATTEMPT PIC 9(16).

       REPORT SECTION.
       RD OUT-REPORT
       CONTROLS RETIREE-ID OF PAYCHECK
       PAGE LIMIT IS 34
       HEADING 1
       FIRST DETAIL 5
       LAST DETAIL 29
       FOOTING 32.

       COPY OUT-REPORT-FOOTING.

`      01 REPORT-HEADING TYPE IS PAGE HEADING.
           05 LINE 1.
               10 COLUMN 26 PIC X(32)
                  VALUE "RosMosGosKosmos".
           05 LINE 2.
               10 COLUMN 23 PIC X(40)
                  VALUE "VIVOD SREDSTV NA EKRAN".
           05 LINE 4.
               10 COLUMN 2 PIC X(10) VALUE "Nomer".
               10 COLUMN 13 PIC X(10) VALUE "Nomer deda".
               10 COLUMN 24 PIC X(11) VALUE "Den'".
               10 COLUMN 35 PIC X(9) VALUE "Summa".
               10 COLUMN 45 PIC X(9) VALUE "Podpisy".

01     01 CONTROL-FOOTING TYPE IS CONTROL FOOTING RETIREE-ID OF PAYCHECK
       NEXT GROUP PLUS 2.
           05 LINE IS PLUS 1.
               19 SMS COLUMN 33 PIC X(1) VALUE "=".
               19 SMS COLUMN 35 PIC 9(6).99 SUM AMOUNT.

       01 REPORT-LINE TYPE IS DETAIL.
           05 LINE PLUS 1.
               10 COLUMN 2 PIC 9(10) SOURCE PAYCHECK-ID.
               10 COLUMN 13 PIC 9(10) SOURCE RETIREE-ID OF PAYCHECK.
               10 COLUMN 24 PIC 9(4) SOURCE YEAR OF PAYCHECK-DATE.
               10 COLUMN 28 PIC X(1) VALUE ".".
               10 COLUMN 29 PIC 9(2) SOURCE MONTH OF PAYCHECK-DATE.
               10 COLUMN 31 PIC X(1) VALUE ".".
               10 COLUMN 32 PIC 9(2) SOURCE DOM OF PAYCHECK-DATE.
               10 COLUMN 35 PIC 9(6).99 SOURCE AMOUNT OF PAYCHECK.
               10 COLUMN 45 PIC X(32) SOURCE SIGNATURE.

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE.
           OPEN INPUT RETIREES.
           OPEN INPUT PAYCHECKS.

           OPEN OUTPUT OUTPUT-FILE.
           INITIATE OUT-REPORT.
           PERFORM FOREVER
               READ INPUT-FILE AT END
                   EXIT PERFORM
               END-READ
               PERFORM PROCESS-LINE
           END-PERFORM.
           TERMINATE OUT-REPORT.
           CLOSE OUTPUT-FILE.

           CLOSE PAYCHECKS.
           CLOSE RETIREES.
           CLOSE INPUT-FILE.
           STOP RUN.

       PROCESS-LINE.
           MOVE RETIREE-ID OF REQUEST-INPUT TO RETIREE-ID OF RETIREE.
           READ RETIREES RECORD
	   INVALID KEY
               DISPLAY 'RETIREE NOT FOUND'
               EXIT PARAGRAPH
           END-READ.

           MOVE RETIREE-ID OF REQUEST-INPUT TO RETIREE-ID OF PAYCHECK.
           READ PAYCHECKS RECORD KEY IS RETIREE-ID OF PAYCHECK
           INVALID KEY
               DISPLAY 'NO PAYCHECKS FOUND'
               EXIT PARAGRAPH
           NOT INVALID KEY GENERATE REPORT-LINE
           END-READ.

           MOVE PASSCODE OF RETIREE TO PASSCODE-VALID.
           MOVE PASSCODE OF REQUEST-INPUT TO PASSCODE-ATTEMPT.
           IF PASSCODE-VALID NOT = PASSCODE-ATTEMPT
               DISPLAY 'INVALID PASSCODE'
               EXIT PARAGRAPH
           END-IF.

           DISPLAY 'SUCCESS, PRINTING'

           PERFORM FOREVER
               READ PAYCHECKS NEXT RECORD
               INVALID KEY
                   EXIT PERFORM
               END-READ
               GENERATE REPORT-LINE
           END-PERFORM.
